app/Controllers/Home.php

    public function pengumuman()
    {
        $siswa = $this->modelSiswa->findAll();
---
SELECT *
FROM `siswa`