app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `username` = 'Admin'
 LIMIT 1
---
   public function index()
   {
      $data = [
         'title' => 'Authorized | Kel 2'
      ];
      $UsersModel  = new UsersModel();
      $login = $this->request->getPost('login');
      if ($login) {
         $username = $this->request->getPost('username');
         $password = $this->request->getPost('password');

         if ($username == '' or $password == '') {
            $err  = "Username / Password Tidak ditemukan";
         }
         if (empty($err)) {
            $data = $UsersModel->where(
               "username",
               $username,
               $username
            )->first();