app/Controllers/PdfController.php

    public function index()
    {
        $data['data'] = $this->modelSiswa->findAll();
---
SELECT *
FROM `siswa`

    public function generate()
    {
        $data['data'] = $this->modelSiswa->findAll();
---
SELECT *
FROM `siswa`