app/Controllers/Siswa.php

SELECT *
FROM `siswa`
---
    public function index()
    {
        $siswa = $this->modelSiswa->findAll();